## Introduction to Databases

### SQLite exercises

!pip install tabulate

In [11]:
import os
import sys
import time
import datetime
import numpy as np
import pandas as pd

from tabulate import tabulate

import sqlite3

![Db Schema](../Figs/database-model.gif)

### Establishing a connection

In [2]:
conn = sqlite3.connect(os.path.join("..","SampleDBs",'hr.sqlite'))
cur = conn.cursor()

In [3]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cur.fetchall())

[('countries',), ('regions',), ('locations',), ('departments',), ('jobs',), ('employees',), ('department',), ('job_history',), ('prod_mast',), ('prod_backup',), ('orders',), ('tb1',), ('ESERCICIO1',), ('users',), ('tags',), ('s',), ('r',), ('Emor',), ('MIN_SALARY',), ('employee_data',), ('STUDENT',), ('EMPLOYEE_INCOME',), ('details',)]

In [14]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(tabulate(cur.fetchall()))

---------------
countries
regions
locations
departments
jobs
employees
department
job_history
prod_mast
prod_backup
orders
tb1
ESERCICIO1
users
tags
s
r
Emor
MIN_SALARY
employee_data
STUDENT
EMPLOYEE_INCOME
details
---------------

In [13]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
for res in cur.fetchall():
    print(res)

('countries',)
('regions',)
('locations',)
('departments',)
('jobs',)
('employees',)
('department',)
('job_history',)
('prod_mast',)
('prod_backup',)
('orders',)
('tb1',)
('ESERCICIO1',)
('users',)
('tags',)
('s',)
('r',)
('Emor',)
('MIN_SALARY',)
('employee_data',)
('STUDENT',)
('EMPLOYEE_INCOME',)
('details',)

In [5]:
df = pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)
df.head(10)

          name
0    countries
1      regions
2    locations
3  departments
4         jobs
5    employees
6   department
7  job_history
8    prod_mast
9  prod_backup

### SQL Questions

+ Write a query to display the names (first_name, last_name) using alias name "First Name", "Last Name" on the table "employees"

In [ ]:
SELECT first_name "First Name",  last_name "Last Name" 
	FROM employees;

+ Write a query to get unique department ID on the table "employees"

In [ ]:
SELECT DISTINCT e.department_id
FROM employees AS e;

+ Write a query to get all employee details from the employee table order by first name, descending on the table "employees"

In [ ]:
SELECT e.*
FROM employees AS e
ORDER BY e.first_name DESC;

+ Write a query to get the names (first_name, last_name), salary, PF of all the employees (PF is calculated as 12% of salary) on the table "employees"

In [ ]:
SELECT e.first_name AS "First Name",
       e.last_name AS "Last Name",
       e.salary AS "Salary",
       e.salary * 0.12 AS "PF"
FROM employees AS e;

+ Write a query to get the employee ID, names (first_name, last_name), salary in ascending order of salary on the table "employees"

In [ ]:
SELECT e.employee_id AS "Employee ID",
       e.first_name AS "First Name",
       e.last_name AS "Last Name",
       e.salary AS "Salary"
FROM employees AS e
ORDER BY e.salary;

+ Write a query to get the total salaries payable to employees on the table "employees"

In [ ]:
SELECT SUM(e.salary) AS total_salaries
FROM employees AS e;

+ Write a query to get the maximum and minimum salary from employees table on the table "employees"

In [ ]:
SELECT MIN(e.salary) AS minimum,
       MAX(e.salary) AS maximum
FROM employees AS e;

+ Write a query to get the average salary and number of employees in the employees table on the table "employees"

In [ ]:
SELECT AVG(e.salary) AS average,
       COUNT(e.employee_id) AS COUNT
FROM employees AS e;

+ Write a query to get the number of employees working with the company on the table "employees"

In [ ]:
SELECT COUNT(e.employee_id) AS COUNT
FROM employees AS e;

+ Write a query to get the number of jobs available in the employees table on the table "employees"

In [ ]:
SELECT COUNT(DISTINCT e.job_id) 
FROM employees AS e;

+ Write a query get all first name from employees table in upper case on the table "employees"

In [ ]:
SELECT UPPER(e.first_name) AS first_name
FROM employees AS e;

+ Write a query to get the first 3 characters of first name from employees table on the table "employees"

In [ ]:
SELECT LEFT(e.first_name, 3)
FROM employees AS e;

+ Write a query to calculate 171*214+625.

In [ ]:
SELECT 171 * 214 + 625
FROM employees;

+ Write a query to get the names (for example Ellen Abel, Sundar Ande etc.) of all the employees from employees table

In [ ]:
SELECT CONCAT(e.first_name, ' ', e.last_name) AS full_name
FROM employees AS e;

+ Write a query to get first name from employees table after removing white spaces from both side on the table "employees"

In [ ]:
SELECT TRIM(first_name) 
    FROM employees;

+ Write a query to get the length of the employee names (first_name, last_name) from employees table on the table "employees"

In [ ]:
SELECT first_name,last_name, LENGTH(first_name)+LENGTH(last_name)  'Length of  Names' 
    FROM employees;

+ Write a query to select first 10 records from a table on the table "employees"  
Note : Assume the salary field provides the 'annual salary' information.

In [ ]:
SELECT e.*
FROM employees AS e
LIMIT 10;

+ Write a query to get monthly salary (round 2 decimal places) of each and every employee? - on the table "employees"

In [ ]:
SELECT e.first_name,
       e.last_name,
       ROUND(e.salary / 12, 2) AS monthly_salary
FROM employees AS e;

+ Write a query to display the names (first_name, last_name) and salary for all employees whose salary is not in the range $10,000 through $15,000 on the table "employees"

In [ ]:
SELECT first_name, last_name, salary
FROM employees
WHERE salary NOT BETWEEN 10000 AND 15000;

+ Write a query to display the names (first_name, last_name) and department ID of all employees in departments 30 or 100 in ascending alphabetical order by department ID on the table "employees"

In [ ]:
SELECT first_name, last_name, department_id
FROM employees
WHERE department_id IN (30, 100)
ORDER BY  department_id  ASC;

+ Write a query to display the names (first_name, last_name) and salary for all employees whose salary is not in the range $10,000 through $15,000 and are in department 30 or 100 on the table "employees"

In [ ]:
SELECT first_name, last_name, salary
FROM employees
WHERE salary NOT BETWEEN 10000 AND 15000;

+ Write a query to display the first_name of all employees who have both an "b" and "c" in their first name. on the table "employees"

In [ ]:
SELECT first_name
FROM employees
WHERE first_name LIKE '%b%'
AND first_name LIKE '%c%';

+ Write a query to display the last name, job, and salary for all employees whose job is that of a Programmer or a Shipping Clerk, and whose salary is not equal to $4,500, $10,000, or $15,000 on the table "employees"

In [ ]:
SELECT last_name, job_id, salary
FROM employees
WHERE job_id IN ('IT_PROG', 'SH_CLERK')
AND salary NOT IN (4500,10000, 15000);

+ Write a query to display the last names of employees whose names have exactly 6 characters on the table "employees"

In [ ]:
SELECT last_name FROM employees WHERE last_name LIKE '______';

+ Write a query to display the last names of employees having 'e' as the third character on the table "employees"

In [ ]:
SELECT last_name FROM employees WHERE last_name LIKE '__e%';

+ Write a query to display the jobs/designations available in the employees table on the table "employees"

In [ ]:
SELECT DISTINCT job_id  FROM employees;

+ Write a query to display the names (first_name, last_name), salary and PF (15% of salary) of all employees on the table "employees"

In [ ]:
SELECT first_name, last_name, salary, salary*.15 PF from employees;

+ Write a query to list the number of jobs available in the employees table.

In [ ]:
SELECT COUNT(DISTINCT job_id) 
FROM employees;

+ Write a query to get the total salaries payable to employees.

In [ ]:
SELECT SUM(salary) 
     FROM employees;

+ Write a query to get the minimum salary from employees table.

In [ ]:
SELECT MIN(salary) 
     FROM employees;

+ Write a query to get the maximum salary of an employee working as a Programmer.

SELECT MAX(salary) 
FROM employees 
WHERE job_id = 'IT_PROG';

+ Write a query to get the average salary and number of employees working the department 90.

In [ ]:
SELECT AVG(salary),count(*) 
FROM employees 
WHERE department_id = 90;

+ Write a query to get the highest, lowest, sum, and average salary of all employees.

In [ ]:
SELECT ROUND(MAX(salary),0) 'Maximum',
ROUND(MIN(salary),0) 'Minimum',
ROUND(SUM(salary),0) 'Sum',
ROUND(AVG(salary),0) 'Average'
FROM employees;

+ Write a query to get the number of employees with the same job.

In [ ]:
SELECT job_id, COUNT(*)
FROM employees
GROUP BY job_id;

+ Write a query to get the difference between the highest and lowest salaries.

In [ ]:
SELECT MAX(salary) - MIN(salary) DIFFERENCE
FROM employees;

+ Write a query to find the manager ID and the salary of the lowest-paid employee for that manager.

In [ ]:
SELECT manager_id, MIN(salary)
FROM employees
WHERE manager_id IS NOT NULL
GROUP BY manager_id
ORDER BY MIN(salary) DESC;

+ Write a query to get the department ID and the total salary payable in each department.

In [ ]:
SELECT department_id, SUM(salary)
FROM employees 
GROUP BY department_id;

+ Write a query to get the average salary for each job ID excluding programmer.

In [ ]:
SELECT job_id, AVG(salary) 
FROM employees 
WHERE job_id <> 'IT_PROG' 
GROUP BY job_id;

+ Write a query to get the total salary, maximum, minimum, average salary of employees (job ID wise), for department ID 90 only.

In [ ]:
SELECT job_id, SUM(salary), AVG(salary), MAX(salary), MIN(salary)
FROM employees 
WHERE department_id = '90' 
GROUP BY job_id;

+ Write a query to get the job ID and maximum salary of the employees where maximum salary is greater than or equal to $4000.

In [ ]:
SELECT job_id, MAX(salary) 
FROM employees 
GROUP BY job_id 
HAVING MAX(salary) >=4000;

+ Write a query to get the average salary for all departments employing more than 10 employees.

In [ ]:
SELECT department_id, AVG(salary), COUNT(*) 
FROM employees 
GROUP BY department_id
HAVING COUNT(*) > 10;

+ Write a query to find the names (first_name, last_name) and salaries of the employees who have a higher salary than the employee whose last_name='Bull'.

In [ ]:
SELECT FIRST_NAME, LAST_NAME, SALARY 
FROM employees 
WHERE SALARY > 
(SELECT salary FROM employees WHERE last_name = 'Bull');

+ Write a query to find the names (first_name, last_name) of all employees who works in the IT department.

In [ ]:
SELECT first_name, last_name 
FROM employees 
WHERE department_id 
IN (SELECT department_id FROM departments WHERE department_name='IT');

+ Write a query to find the names (first_name, last_name) of the employees who have a manager who works for a department based in the United States. Hint : Write single-row and multiple-row subqueries

In [ ]:
SELECT first_name, last_name FROM employees 
WHERE manager_id in (select employee_id 
FROM employees WHERE department_id 
IN (SELECT department_id FROM departments WHERE location_id 
IN (select location_id from locations where country_id='US')));

+ Write a query to find the names (first_name, last_name) of the employees who are managers.

In [ ]:
SELECT first_name, last_name 
FROM employees 
WHERE (employee_id IN (SELECT manager_id FROM employees));

+ Write a query to find the names (first_name, last_name), the salary of the employees whose salary is greater than the average salary.

In [ ]:
SELECT first_name, last_name, salary FROM employees 
WHERE salary > (SELECT AVG(salary) FROM employees);

+ Write a query to find the names (first_name, last_name), the salary of the employees whose salary is equal to the minimum salary for their job grade.

In [ ]:
SELECT first_name, last_name, salary 
FROM employees 
WHERE employees.salary = (SELECT min_salary
FROM jobs
WHERE employees.job_id = jobs.job_id);

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn more than the average salary and who works in any of the IT departments.

In [ ]:
SELECT first_name, last_name, salary 
FROM employees 
WHERE department_id IN 
(SELECT department_id FROM departments WHERE department_name LIKE 'IT%') 
AND salary > (SELECT avg(salary) FROM employees);

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn more than Mr. Bell.

In [ ]:
SELECT first_name, last_name, salary 
FROM employees 
WHERE salary > 
(SELECT salary FROM employees WHERE last_name = 'Bell') ORDER BY first_name;

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn the same salary as the minimum salary for all departments.

In [ ]:
SELECT * FROM employees 
WHERE salary = (SELECT MIN(salary) FROM employees);

+ Write a query to find the names (first_name, last_name) of the employees who are not supervisors.

In [ ]:
SELECT b.first_name,b.last_name 
FROM employees b 
WHERE NOT EXISTS (SELECT 'X' FROM employees a WHERE a.manager_id = b.employee_id);

+ Write a query to display the employee ID, first name, last names, salary of all employees whose salary is above average for their departments.

In [ ]:
SELECT employee_id, first_name 
FROM employees AS A 
WHERE salary > 
(SELECT AVG(salary) FROM employees WHERE department_id = A.department_id);

+ Write a query to find the 5th maximum salary in the employees table.

In [ ]:
SELECT employee_id, first_name 
FROM employees AS A 
WHERE salary > 
(SELECT AVG(salary) FROM employees WHERE department_id = A.department_id);

+ Write a query to find the 4th minimum salary in the employees table.

In [ ]:
SELECT DISTINCT salary 
FROM employees e1 
WHERE 4 = (SELECT COUNT(DISTINCT salary) 
FROM employees  e2 
WHERE e2.salary <= e1.salary);

+ Write a query to select last 10 records from a table.

SELECT * FROM (
SELECT * FROM employees ORDER BY employee_id DESC LIMIT 10) sub 
ORDER BY employee_id ASC;

+ Write a query to list department number, name for all the departments in which there are no employees in the department.

In [ ]:
SELECT * FROM departments 
WHERE department_id 
NOT IN (select department_id FROM employees);

+ Write a query to find the addresses (location_id, street_address, city, state_province, country_name) of all the departments.

In [ ]:
SELECT location_id, street_address, city, state_province, country_name
FROM locations
NATURAL JOIN countries;

+ Write a query to find the names (first_name, last name), department ID and the name of all the employees.

In [ ]:
SELECT first_name, last_name, department_id, department_name 
FROM employees 
JOIN departments USING (department_id);

+ Write a query to find the employee id, name (last_name) along with their manager_id, manager name (last_name).

In [ ]:
SELECT e.employee_id 'Emp_Id', e.last_name 'Employee', 
m.employee_id 'Mgr_Id', m.last_name 'Manager' 
FROM employees e 
join employees m 
ON (e.manager_id = m.employee_id);

+ Write a query to find the names (first_name, last_name) and hire date of the employees who were hired after 'Jones'.

In [ ]:
SELECT e.first_name, e.last_name, e.hire_date 
FROM employees e 
JOIN employees davies 
ON (davies.last_name = 'Jones') 
WHERE davies.hire_date < e.hire_date;

+ Write a query to get the department name and number of employees in the department.

In [ ]:
SELECT department_name AS 'Department Name', 
COUNT(*) AS 'No of Employees' 
FROM departments 
INNER JOIN employees 
ON employees.department_id = departments.department_id 
GROUP BY departments.department_id, department_name 
ORDER BY department_name;

+ Write a query to find the employee ID, job title number of days between ending date and starting date for all jobs in department 90 from job history.

In [ ]:
SELECT employee_id, job_title, end_date-start_date Days FROM job_history 
NATURAL JOIN jobs 
WHERE department_id=90;

+ Write a query to display the department ID, department name, and manager first name.

In [ ]:
SELECT d.department_id, d.department_name, d.manager_id, e.first_name 
FROM departments d 
INNER JOIN employees e 
ON (d.manager_id = e.employee_id);

+ Write a query to display the department name, manager name, and city.

In [ ]:
SELECT d.department_name, e.first_name, l.city 
FROM departments d 
JOIN employees e 
ON (d.manager_id = e.employee_id) 
JOIN locations l USING (location_id);

+ Write a query to display the job title and average salary of employees.

In [ ]:
SELECT job_title, AVG(salary) 
FROM employees 
NATURAL JOIN jobs 
GROUP BY job_title;

+ Write a query to to display job title, employee name, and the difference between the salary of the employee and minimum salary for the job.

In [ ]:
SELECT job_title, first_name, salary-min_salary 'Salary - Min_Salary' 
FROM employees 
NATURAL JOIN jobs;

+ Write a query to display the job history that was done by any employee who is currently drawing more than 10000 of salary.

In [ ]:
SELECT jh.* FROM job_history jh 
JOIN employees e 
ON (jh.employee_id = e.employee_id) 
WHERE salary > 10000;